IDEA Open Model
VariableType Enumeration
 Variable type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public enum VariableType
Public Enumeration VariableType
public enum class VariableType
Members
Member name | Value | Description
Standard | 0 |  Standard
MobileEnvelope | 1 |  Mobile envelope
Seismicity | 2 |  Seismicity
NotSet | 3 |  variable loads is not set for some reasons - in fact loads is not variable
See Also
Reference
IdeaRS.OpenModel.Loading Namespace